types_of_artifact = ["Цветок жизни", "Перо смерти", "Пески времени", "Кубок пространства", "Корона разума"]
# НР на русском языке
sets_dict = {
    1: 'Конец гладиатора',
    2: 'Странствующий ансамбль',
    3: 'Церемония древней знати',
    4: 'Рыцарь крови',
    5: 'Возлюбленная юная дева',
    6: 'Изумрудная тень',
    7: 'Архаичный камень',
    8: 'Встречная комета',
    9: 'Усмиряющий гром',
    10: 'Громогласный рёв ярости',
    11: 'Ступающий по лаве',
    12: 'Горящая алая ведьма',
    13: 'Заблудший в метели',
    14: 'Сердце глубин',
    15: 'Стойкость Миллелита',
    16: 'Бледный огонь',
    17: 'Воспоминания Симэнавы',
    18: 'Эмблема рассечённой судьбы',
    19: 'Кокон сладких грёз',
    20: 'Моллюск морских красок',
    21: 'Киноварное загробье',
    22: 'Отголоски подношения',
    23: 'Воспоминания дремучего леса',
    24: 'Позолоченные сны',
    25: 'Хроники Чертогов в пустыне',
    26: 'Цветок потерянного рая',
    27: 'Сон нимфы',
    28: 'Сияние Вурукаши',
    29: 'Охотник Сумеречного двора',
    30: 'Золотая труппа',
}
sets = [
    "Конец гладиатора",
    "Странствующий ансамбль",
    "Церемония древней знати",
    "Рыцарь крови",
    "Возлюбленная юная дева",
    "Изумрудная тень",
    "Архаичный камень",
    "Встречная комета",
    "Усмиряющий гром",
    "Громогласный рёв ярости",
    "Ступающий по лаве",
    "Горящая алая ведьма",
    "Заблудший в метели",
    "Сердце глубин",
    "Стойкость Миллелита",
    "Бледный огонь",
    "Воспоминания Симэнавы",
    "Эмблема рассечённой судьбы",
    "Кокон сладких грёз",
    "Моллюск морских красок",
    "Киноварное загробье",
    "Отголоски подношения",
    "Воспоминания дремучего леса",
    "Позолоченные сны",
    "Хроники Чертогов в пустыне",
    "Цветок потерянного рая",
    "Сон нимфы",
    "Сияние Вурукаши",
    "Охотник Сумеречного двора",
    "Золотая труппа",
]

sub_stats_dict = {
    1: "НР ",
    2: "НР (%)",
    3: "Сила атаки",
    4: "Сила атаки (%)",
    5: "Защита",
    6: "Защита (%)",
    7: "Мастерство стихий",
    8: "Восст. энергии",
    9: 'Шанс крит. попадания',
    10: 'Крит. урон'
}
sub_stats = ['НР ',  
             'НР (%)',
             'Сила атаки',
             'Сила атаки (%)',
             'Защита',
             'Защита (%)',
             'Мастерство стихий',
             'Восст. энергии',
             'Шанс крит. попадания',
             'Крит. урон']

goblet_main_stat_dict = {
    1: "НР (%)",
    2: "Сила атаки (%)",
    3: "Защита (%)",
    4: "Мастерство стихий",
    5: "Бонус физ. урона (%)",
    6: "Бонус Анемо урона (%)",
    7: "Бонус Гео урона (%)",
    8: "Бонус Гидро урона (%)",
    9: "Бонус Дендро урона (%)",
    10: "Бонус Крио урона (%)",
    11: "Бонус Пиро урона (%)",
    12: "Бонус Электро урона (%)"
}
goblet_main_stat = ['НР (%)',
                    'Сила атаки (%)',
                    'Защита (%)',
                    'Мастерство стихий',
                    'Бонус физ. урона (%)',
                    'Бонус Анемо урона (%)',
                    'Бонус Гео урона (%)',
                    'Бонус Гидро урона (%)',
                    'Бонус Дендро урона (%)',
                    'Бонус Крио урона (%)',
                    'Бонус Пиро урона (%)',
                    'Бонус Электро урона (%)']

sands_main_stat_dict = {
    1: "НР (%)",
    2: "Сила атаки (%)",
    3: "Защита (%)",
    4: "Мастерство стихий",
    5: "Восстановление энергии"
}
sands_main_stat = ['НР (%)',
                   'Сила атаки (%)',
                   'Защита (%)',
                   'Мастерство стихий',
                   'Восстановление энергии']

circlet_main_stat_dict = {
    1: "НР (%)",
    2: "Сила атаки (%)",
    3: "Защита (%)",
    4: "Мастерство стихий",
    5: "Бонус лечения (%)",
    6: "Шанс крит. попадания",
    7: "Крит. урон"
}
circlet_main_stat = ['НР (%)',
                     'Сила атаки (%)',
                     'Защита (%)',
                     'Мастерство стихий',
                     'Бонус лечения (%)',
                     "Шанс крит. попадания",
                     "Крит. урон"
                     ]

char_list = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ0123456789,%+ '
